package gr.aueb.cf.ch6;

/**
 *  Arrays Demo.
 */
public class PopulateArrayApp {
    public static void main(String[] args) {
        int[] arr = new int[5]; /* το new κατανέμει δυναμικά χώρο at run time.
         Το heap είναι σημείο της μνήμης όπου εισάγουμε σύνθετους δεδομένους που δεν ξέρουμε τι είναι.
         Το new δεσμεύει χώρο στο heap και επιστρέφει τη διεύθυνση μνήμη του πρώτου στοιχείου στη μεταβλητή,
         η οποία βρίσκεται στο stack.*/
        /*Άλλο πράγμα το όνομα ενός πίνακα και άλλο τα περιεχόμενα του. Οι σύνθετοι τύποι ονομάζονται references.
        * Όταν αρχικοποιούμε έναν πίνακα η τιμή που παίρνει είναι 0.
        * Η τελευταία θέση του πίνακα είναι .lenght-1
        * Με τον indexer μπορούμε είτε να κάνουμε set να εισάγουμε ένα στοιχείο
        * είτε να διαβάσουμε ένα στοιχείο get.
        * Αν πάμε να διαβάσουμε το length θα βγάλει σφάλμα. Πρέπει να γράφουμε lenght-1*/

        //Populate. == σημαίνει insert values.
        arr[0] = 1;
        arr[1] = 10;
        arr[2] = 20;
        arr[3] = 60;
        arr[4] = 90;

        //Unsized Initialization
        int[] arr2 = {1,2,3,4,5,6,7}; // length == 7

        System.out.println(arr2[0]);
        System.out.println(arr2[6]);

        //Array Initializer --> μπορεί να χωριστεί και σε 2 γραμμές.
        /*Η διαφορά με το από πάνω είναι ότι μπορεί να χωριστεί σε 2 γραμμές. Το αποπάνω με το που δηλωθεί πρέπει και να αρχικοποιηθεί. */

        int[] arr3 = new int[] {1,3,5,7};
    }
}
